//=======================================================================
//.T		包含文件.
//=======================================================================
#include <stdbool.h>
#include <stdint.h>
//-----------------------
#ifndef		__JC_RGB_LED_MODE_H__
#define		__JC_RGB_LED_MODE_H__

//=======================================================================
//.T		全局函数声明.
//=======================================================================
void RGB_mode_gpio_init(void);
void RGB_8color_set(uint8_t i);
void RGB_reflash_ctl(void);
void RGB_show_color(uint8_t i);
void RGB_flash_color(uint8_t i);
void RGB_Gradient_color(uint8_t i);

//=======================================================================
#endif	//__JC_RGB_LED_MODE_H__.

//********************************* end *********************************//
